==================
YYYY-MM-DD
==================
2025-07-25

---

(source_file
  (transaction_plain
    (date)))

==================
YYYY/MM/DD
==================
2025/07/25

---

(source_file
  (transaction_plain
    (date)))

==================
YYYY.MM.DD
==================
2025.07.25

---

(source_file
  (transaction_plain
    (date)))

==================
MM-DD
==================
07-25

---

(source_file
  (transaction_plain
    (date)))

==================
MM/DD
==================
07/25

---

(source_file
  (transaction_plain
    (date)))

==================
MM.DD
==================
07.25

---

(source_file
  (transaction_plain
    (date)))

==================
Secondary date
==================
2025-07-25=2025-07-28

---

(source_file
  (transaction_plain
    (date
      (secondary_date))))

