==================
old: alias directive
==================
alias old = new

---

(TODO)

==================
old: alias directive with multiple segments
==================
alias old:account = new:account

---

(TODO)

==================
old: alias directive with semicolon
==================
alias old:acco;unt = new:acco;unt

---

(TODO)

==================
old: alias directive with regex
==================
alias /(.*)/ = new:\1

---

(TODO)

==================
old: end aliases
==================
end aliases

---

(TODO)

==================
Inline comment
==================
alias old = new  ; a comment

---

(TODO)

