==================
Complete
==================
2025-05-24 ! (code) Payee | why do i do this?  ; because
    ; for some reason
    ! expenses:expensive thing  1,000.00 $ @@ 1,234.56 €
    ! assets:cash  € -1,234.56 ; date:2025-05-30
    ; at least i have a few days time to pay this
    * [expenses:stupid tax]  1.234.56 €
    * [assets:stupid budget]  -1,234.56 €
    * (expenses:aaaaaa) 1.234.56 €

---

(journal
  (journal_item
    (transaction
      (transaction_plain
        (date)
        (status)
        (code)
        (description
          (payee))
        (comment)
        (comment)
        (posting
          (posting_plain
            (status)
            (account)
            (amount
              (quantity)
              (commodity))
            (cost
              (amount
                (quantity)
                (commodity)))))
        (posting
          (posting_plain
            (status)
            (account)
            (amount
              (commodity)
              (quantity))
            (comment
              (tag))))
        (comment)
        (posting
          (posting_virtual_balanced
            (status)
            (account)
            (amount
              (quantity)
              (commodity))))
        (posting
          (posting_virtual_balanced
            (status)
            (account)
            (amount
              (quantity)
              (commodity))))
        (posting
          (posting_virtual_balanced
            (status)
            (account)
            (amount
              (quantity)
              (commodity))))))))

==================
Minimal
==================
2025-05-24

---

(journal
  (journal_item
    (transaction
      (transaction_plain
        (date)))))

==================
Common example
==================
2025-05-24 Payee | Reason
    expenses:groceries  12.34 €
    assets:cash  -12.34 €

---

(journal
  (journal_item
    (transaction
      (transaction_plain
        (date)
        (description
          (payee))
        (posting
          (posting_plain
            (account)
            (amount
              (quantity)
              (commodity))))
        (posting
          (posting_plain
            (account)
            (amount
              (quantity)
              (commodity))))))))

==================
Description
==================
2025-05-24 Description
    expenses

---

(journal
  (journal_item
    (transaction
      (transaction_plain
        (date)
        (description)
        (posting
          (posting_plain
            (account)))))))

==================
Payee and note
==================
2025-05-24 Payee | Note
    expenses

---

(journal
  (journal_item
    (transaction
      (transaction_plain
        (date)
        (description
          (payee))
        (posting
          (posting_plain
            (account)))))))

==================
Status Pending
==================
2025-05-24 ! note
    expenses

---

(journal
  (journal_item
    (transaction
      (transaction_plain
        (date)
        (status)
        (description)
        (posting
          (posting_plain
            (account)))))))

==================
Status Cleared
==================
2025-05-24 * note
    expenses

---

(journal
  (journal_item
    (transaction
      (transaction_plain
        (date)
        (status)
        (description)
        (posting
          (posting_plain
            (account)))))))

==================
Code
==================
2025-05-24 (code) note
    expenses

---

(journal
  (journal_item
    (transaction
      (transaction_plain
        (date)
        (code)
        (description)
        (posting
          (posting_plain
            (account)))))))

==================
Inline comment
==================
2025-05-24 Something ; a comment

---

(journal
  (journal_item
    (transaction
      (transaction_plain
        (date)
        (description)
        (comment)))))

==================
Inline comment with tags
==================
2025-05-24 Something ; a comment event:2025-05-24_cool-event, partying:

---

(journal
  (journal_item
    (transaction
      (transaction_plain
        (date)
        (description)
        (comment
          (tag)
          (tag))))))

==================
Following comment
==================
2025-05-24 Something
  ; a comment

---

(journal
  (journal_item
    (transaction
      (transaction_plain
        (date)
        (description)
        (comment)))))

==================
Following comment with tags
==================
2025-05-24 Something
  ; event:2025-05-24_cool-event, partying:

---

(journal
  (journal_item
    (transaction
      (transaction_plain
        (date)
        (description)
        (comment
          (tag)
          (tag))))))

